
# Import Libraries & Dataset

In [1]:
import pandas as pd
df=pd.read_excel(r"C:\Users\Aasem\Desktop\sales.xlsx")

In [2]:
df.head()

   Manager Location  Sales  Profit
0   Prachi   Mumbai    200      80
1   Pritam     Pune    150      70
2    Rahul   Mumbai    300      60
3   Akshay     Pune    120      40
4  Shubham    Delhi    100      30

In [3]:
df.shape

(10, 4)

In [4]:
df.columns

Index(['Manager', 'Location', 'Sales', 'Profit'], dtype='object')

In [5]:
df.dtypes

Manager     object
Location    object
Sales        int64
Profit       int64
dtype: object

# Preprocessing

In [6]:
df.isnull().sum()

Manager     0
Location    0
Sales       0
Profit      0
dtype: int64

In [7]:
import seaborn as sns
sns.heatmap(df.isnull())

In [8]:
df.dtypes

Manager     object
Location    object
Sales        int64
Profit       int64
dtype: object

In [9]:
df['Location'].unique()

array(['Mumbai', 'Pune', 'Delhi', 'Bangolre'], dtype=object)

In [10]:
print(len(df['Location'].unique()))

4

In [11]:
df.duplicated().sum()

0

# Exploratory Data Analysis

In [12]:
df['Sales'].max()

300

In [13]:
df['Sales'].min()

100

In [14]:
df['Sales'].mean()

160.0

In [15]:
df['Sales'].std()

79.86099033807292

In [16]:
df.groupby('Location').std()

              Sales     Profit
Location
Bangolre  10.000000  10.408330
Delhi      0.000000   7.071068
Mumbai    57.735027  15.275252
Pune      21.213203  21.213203

In [17]:
df['Profit'].max()

80

In [18]:
df['Profit'].min()

20

In [19]:
df['Profit'].mean()

43.5

In [20]:
df['Profit'].std()

21.08843811718218

In [21]:
df.describe()

           Sales     Profit
count   10.00000  10.000000
mean   160.00000  43.500000
std     79.86099  21.088438
min    100.00000  20.000000
25%    102.50000  26.250000
50%    120.00000  40.000000
75%    187.50000  57.500000
max    300.00000  80.000000

# Find Total Sales For Each City ?

In [22]:
df.groupby(['Location']).sum()

          Sales  Profit
Location
Bangolre    330      85
Delhi       200      50
Mumbai      800     190
Pune        270     110

# Find Top Sales Maker Manager in Each City ?

In [23]:
df.sort_values('Sales', ascending=False).drop_duplicates(['Location']).reset_index()

   index  Manager  Location  Sales  Profit
0      2    Rahul    Mumbai    300      60
1      1   Pritam      Pune    150      70
2      6   Pranay  Bangolre    120      25
3      4  Shubham     Delhi    100      30

# Find Top Profit Maker Manager in Each City ?

In [24]:
df['Profit %']=(df['Profit']/df['Sales'])*100

In [25]:
df.sort_values('Profit %', ascending=False).drop_duplicates(['Location']).reset_index()

   index  Manager  Location  Sales  Profit   Profit %
0      1   Pritam      Pune    150      70  46.666667
1      0   Prachi    Mumbai    200      80  40.000000
2      5   Deepak  Bangolre    100      40  40.000000
3      4  Shubham     Delhi    100      30  30.000000